sysbench/results/local/vitess/alta/parallel/re-test-notBetwen/read_4.txt
sysbench 1.0.20 (using system LuaJIT 2.1.0-beta3)

Running the test with following options:
Number of threads: 50
Initializing random number generator from current time


Initializing worker threads...

Threads started!

SQL statistics:
    queries performed:
        read:                            33100
        write:                           0
        other:                           0
        total:                           33100
    transactions:                        3310   (54.63 per sec.)
    queries:                             33100  (546.34 per sec.)
    ignored errors:                      0      (0.00 per sec.)
    reconnects:                          0      (0.00 per sec.)

General statistics:
    total time:                          60.5816s
    total number of events:              3310

Latency (ms):
         min:                                  575.13
         avg:                                  912.26
         max:                                 1403.36
         95th percentile:                     1129.24
         sum:                              3019575.21

Threads fairness:
    events (avg/stddev):           66.2000/0.66
    execution time (avg/stddev):   60.3915/0.16